# Day - 19 DIY

**Q1. Problem Statement: Measures of Central Tendency-I**

Write a Python program to declare a 1-D array. With the help of the statistics library, calculate the Mean, Median, and Mode.

In [2]:
#problem statement-1

#importing a required libraries
import numpy as np
import statistics as st
#declare the array
a=np.array([1,2,3,4,5,6,2,3,4,5,5,5,5])
#calculate the mean, median,mode
mean = st.mean(a)
median = st.median(a)
mode = st.mode(a)
#print the result
print("Mean of the Array is:", mean)
print("Median of the Array is:", median)
print("Mode of the Array is:", mode)

Mean of the Array is: 3
Median of the Array is: 4
Mode of the Array is: 5

**Q2. Problem Statement: Measures of Central Tendency-II**

Write a Python program to declare a DataFrame as shown in the dataset section below and calculate the Mean, Median, and Mode of the entire DataFrame.

In [3]:
import pandas as pd
data= {'Apple':[10,7,55,15,7,5],'Orange':[20,14,15,14,1,4],
       'Banana':[30,21,8,1,1,9],"Pear":[40,28,12,8,8,2]}

df=pd.DataFrame(data, index=['Bag1','Bag2','Bag3','Bag4','Bag5','Bag6'])
print(df)

      Apple  Orange  Banana  Pear
Bag1     10      20      30    40
Bag2      7      14      21    28
Bag3     55      15       8    12
Bag4     15      14       1     8
Bag5      7       1       1     8
Bag6      5       4       9     2

In [14]:
#calculate the mean
print("Calculating the Mean:\n")
print(df.mean().round(6))
#calculate the median
print("Calculating the Median:\n")
print(df.median().round(6))
#calculate the Mode
print("calculating the Mode:\n")
print(df.mode(axis=0).round(6))

Calculating the Mean:

Apple     16.500000
Orange    11.333333
Banana    11.666667
Pear      16.333333
dtype: float64
Calculating the Median:

Apple      8.5
Orange    14.0
Banana     8.5
Pear      10.0
dtype: float64
calculating the Mode:

   Apple  Orange  Banana  Pear
0      7      14       1     8

**Q3. Problem Statement: Measures of Central Tendency-III**

Load the “Books.csv”dataset into a DataFrame and perform the following tasks:1.Perform   initial   analysis   on   the dataset   using   the info()and  the describe()functions2.Group the data based on the "Author"column and calculate the average user ratings and average price,and write them in new columns3.Find out which of the authorshave writtenthe maximum number of books

In [4]:
#importing the csv file
df=pd.read_csv("Books.csv")
print(df)

                                                  Name                 Author  \
0    Act Like a Lady, Think Like a Man: What Men Re...           Steve Harvey
1    Arguing with Idiots: How to Stop Small Minds a...             Glenn Beck
2            Breaking Dawn (The Twilight Saga, Book 4)        Stephenie Meyer
3          Crazy Love: Overwhelmed by a Relentless God           Francis Chan
4    Dead And Gone: A Sookie Stackhouse Novel (Sook...       Charlaine Harris
..                                                 ...                    ...
695                   The Wonderful Things You Will Be  Emily Winfield Martin
696                                 Ugly Love: A Novel         Colleen Hoover
697                                             Verity         Colleen Hoover
698               What to Expect When You're Expecting          Heidi Murkoff
699                            Where the Crawdads Sing            Delia Owens

     User Rating  Reviews  Price  Year        Genre
0            4.6     5013     17  2009  Non Fiction
1            4.6      798      5  2009  Non Fiction
2            4.6     9769     13  2009      Fiction
3            4.7     1542     14  2009  Non Fiction
4            4.6     1541      4  2009      Fiction
..           ...      ...    ...   ...          ...
695          4.9    20920      9  2022      Fiction
696          4.7    33929     10  2022      Fiction
697          4.6    71826     11  2022      Fiction
698          4.8    27052     13  2022  Non Fiction
699          4.8   208917     10  2022      Fiction

[700 rows x 7 columns]

In [6]:
#initial analysis
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         700 non-null    object
 1   Author       700 non-null    object
 2   User Rating  700 non-null    float64
 3   Reviews      700 non-null    int64
 4   Price        700 non-null    int64
 5   Year         700 non-null    int64
 6   Genre        700 non-null    object
dtypes: float64(1), int64(3), object(3)
memory usage: 38.4+ KB

In [50]:
df.describe()

       User Rating        Reviews       Price         Year
count   700.000000     700.000000  700.000000   700.000000
mean      4.639857   19255.195714   12.700000  2015.500000
std       0.218586   23613.443875    9.915162     4.034011
min       3.300000      37.000000    0.000000  2009.000000
25%       4.500000    4987.250000    7.000000  2012.000000
50%       4.700000   10284.000000   11.000000  2015.500000
75%       4.800000   23358.000000   15.000000  2019.000000
max       4.900000  208917.000000  105.000000  2022.000000

In [7]:
#Average price(Mean)
price_df =  df.groupby(['Author'],as_index=False).Price.mean()
price_df.rename(columns = {'Price':'Average_Price'}, inplace = True)
display(price_df)

                 Author  Average_Price
0      Abraham Verghese      11.000000
1        Adam Gasiewski       6.000000
2         Adam Mansbach       9.000000
3          Adam Silvera       8.000000
4          Adam Wallace       6.250000
..                  ...            ...
300    William P. Young       8.000000
301    Wizards RPG Team      27.000000
302  Wonder House Books      16.000000
303  Workman Publishing       7.666667
304        Zhi Gang Sha      11.500000

[305 rows x 2 columns]

In [8]:
#Average price(Mean)
price_df =  df.groupby(['Author'],as_index=False).Price.mean()
price_df.rename(columns = {'Price':'Average_Price'}, inplace = True)
display(price_df)

                 Author  Average_Price
0      Abraham Verghese      11.000000
1        Adam Gasiewski       6.000000
2         Adam Mansbach       9.000000
3          Adam Silvera       8.000000
4          Adam Wallace       6.250000
..                  ...            ...
300    William P. Young       8.000000
301    Wizards RPG Team      27.000000
302  Wonder House Books      16.000000
303  Workman Publishing       7.666667
304        Zhi Gang Sha      11.500000

[305 rows x 2 columns]

In [54]:
#Finding the author who has wrote maximum number of books.
print("Maximum number of books are written by: ")
display(df['Author'].mode())

Maximum number of books are written by:

0    Gary Chapman
1     Jeff Kinney
Name: Author, dtype: object